wegam/STM32F1xWOW/Examples/APP_HC/PC006V21 - 20180102.C
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : PC001V21.c
* Author             : WOW
* Version            : V2.0.1
* Date               : 06/26/2017
* Description        : PC001V21层控制板.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/





#ifdef PC006V21			//分检机控制板

#include "PC006V21.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


#include "STM32_TIM.H"
#include "SWITCHID.H"
#include "STM32_WDG.H"
#include "STM32_EXTI.H"
#include "STM32_GPIO.H"
#include "STM32_PWM.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_CAN.H"
#include "STM32F10x_BitBand.H"


#define	TestModel		//测试模式：测试模式下，1~4,4~1旋转
//SW6 ON表示与旋转相关的板，传感器信号采集板/旋转电机控制板
//SW5 ON表示旋转电机控制板，OFF表示传感器板


//===============旋转电机控制板与旋转相关传感器信号采集板专用通讯滤波器组
//CAN滤波器组使用 0x0A
//传感器板CAN-ID为0x80
//旋转电机控制板CAN-ID为0xC0
#define	MotorBD_Group		0x0A
#define	MotorBD_ID			0xC0
#define	SensorBD_Group	MotorBD_Group
#define	SensorBD_ID			0x80



//===============旋转电机控制板对外接口---接收电机控制命令
//CAN滤波器组0x09
//CAN-ID为0xCC			运行到指定窗口命令0xFA 0x55 nWindows
#define	Cmd_Group		0x09
#define	Cmd_ID			0xCC

//===============其它数据通讯端口
//CAN滤波器组 0x08
//CAN-ID为拔码地址
#define	DATA_Group	0x08
#define	DATA_ID			0xFA

#define	CAN1_BaudRate	500000		//CAN波特率	500K


//=================PA7电机控制板CCW做脉冲输出
#define	MOTOR_Plus_PORT		GPIOA
#define	MOTOR_Plus_Pin		GPIO_Pin_7
//=================PA6电机控制板CW做方向输出
#define	MOTOR_DIR_PORT		GPIOA
#define	MOTOR_DIR_Pin			GPIO_Pin_6

#define	MOTOR_PlusHigh		MOTOR_Plus_PORT->BSRR 	= MOTOR_Plus_Pin		//Plus	=	1;	//高电平
#define	MOTOR_PlusLow			MOTOR_Plus_PORT->BRR 		= MOTOR_Plus_Pin		//Plus	=	0;	//低电平
#define	MOTOR_RunRight		MOTOR_DIR_PORT->BSRR 		= MOTOR_DIR_Pin			//EN	=	1;	//顺时针
#define	MOTOR_RunLeft			MOTOR_DIR_PORT->BRR			= MOTOR_DIR_Pin			//EN	=	0;	//逆时钟

//=================PA6传感器板CCW做脉冲输出
#define	TXLED_PORT	GPIOA
#define	TXLED_Pin		GPIO_Pin_7
//=================PA7传感器板CW做方向输出
#define	RXLED_PORT	GPIOA
#define	RXLED_Pin		GPIO_Pin_6

#define	MOTOR_PWM_Frequency		500			//脉冲频率--单位Hz
#define	PWM_UpdataCount			2			//频率变化占计数个数，加减速时PWM_Updata个脉冲后更新一次输出频率
#define	PWM_RunUpCount			500		//加速/减速需要的步数
#define	MOTOR_TIMx				TIM1		//旋转电机所使用的定时器

#define	SteepPerWindow			2*2030				//一个窗口用到的驱动脉冲数
#define	MaxWindow		5					//最大窗口数



//#define	MOTOR_RunRight			MOTOR_DIR_PORT->BRR 	= MOTOR_DIR_Pin		//EN	=	1;	//顺时针
//#define	MOTOR_RunLeft			MOTOR_DIR_PORT->BSRR		= MOTOR_DIR_Pin		//EN	=	0;	//逆时钟

//=================传感器
#define	Sensor1_Port	GPIOB		//前传感器
#define	Sensor1_Pin		GPIO_Pin_4

#define	Sensor2_Port	GPIOB		//后传感器
#define	Sensor2_Pin		GPIO_Pin_5

#define	Sensor3_Port	GPIOB		//药品传感器
#define	Sensor3_Pin		GPIO_Pin_6

#define	Sensor4_Port	GPIOB		//备用传感器
#define	Sensor4_Pin		GPIO_Pin_7

//======传感器状态：：读取状态为高表示无信号，低-有信号
#define	Sensor1_Status	(Sensor1_Port->IDR & Sensor1_Pin)	//不启用
#define	Sensor2_Status	(Sensor2_Port->IDR & Sensor2_Pin)	//原点
#define	Sensor3_Status	(Sensor3_Port->IDR & Sensor3_Pin)	//中间传感器
#define	Sensor4_Status	(Sensor4_Port->IDR & Sensor4_Pin)	//不启用

SWITCHID_CONF SWITCHID;					//拔码开关结构体
PWM_TimDef		PWM_Tim;					//PWM控制脉冲结构体

u8 SwitchData	=	0;	//存储拔码开关最新地址，如果地址变化，再重新配置运行参数
u8 SensorBD		=	0;	//传感器板标志，0-非传感器板，1-传感器板
u8 MotorBD		=	0;	//旋转电机控制板标志，0-非电机控制板，1-电机控制板
u32	MotorTime	=	0;	//旋转电机测试运行时间

//u8	CANID	=	0;
u16 SYSTime=0;
//u16 data=0;
//u8 Flag=0;
u8 Sensor[4]	=	{0};	//4个传感器感应值存储区
u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报

//=================================旋转电机相关变量
u8 PowerFag	=	0;
u8 PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
u8 RunToWindow				=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
u8 StatusOfWindow			=	0;		//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
u8 CMDOfWindow				=	0;		//运行到指定窗口命令
u16	RunFrequency			=	0;		//当前运行频率
u32 SteepCount				=	0;		//运行步数计数
u32 SteepNeedToRun		=	0;		//需要运行的总步数
#ifdef	TestModel
u8	CCWFlag		=	0;
u8	StartTest		=	0;
u32	TestTime	=	0;
#endif

CanRxMsg RxMessage;			//CAN接收 
//CanTxMsg TxMessage;			//CAN发送



//========================配置程序
void SWITCHID_Configuration(void);			//拔码开关初始化及读数
void MotorBoard_Configuration(void);					//旋转电机控制板配置
void SensorBoard_Configuration(void);		//旋转控制传感器板配置


//========================驱动程序
void Motor_RunSet(int Num);			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
	
void Reset_Data(void);					//复位所有的全局变量值
u8 SetToWindows(u8* nWindows);	//运行到指定窗口	

void Test_modle(void);					//测试模式：测试模式下，1~4,4~1旋转	---宏定义TestModel

//========================服务程序
void SensorBoard_Server(void);		//传感器板服务程序
void MotorBoard_Server(void);		//电机控制板服务程序
u8 Motor_Server(void);				//步进电机返回状态
void CAN_Server(void);				//CAN收发数据管理
void Switch_Server(void);			//检查拔码地址有无变更，如果变更，重新配置运行参数
/*******************************************************************************
*函数名		:	function
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void PC006V21_Configuration(void)
{
	
	SYS_Configuration();				//系统配置 STM32_SYS.H	
	SysTick_DeleymS(500);				//SysTick延时nmS
	SysTick_Configuration(1000);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
	
	SWITCHID_Configuration();			//拔码开关初始化及读数


	if(SensorBD)
	{
		SensorBoard_Configuration();	//旋转控制传感器板配置
	}
	else if(MotorBD)
	{		
		MotorBoard_Configuration();					//旋转电机控制板配置
	}
	else
	{
		SysTick_Configuration(1000);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
	}
	
	PWM_OUT(TIM2,PWM_OUTChannel1,5,900);			//SYS-LED 1HZ 50%
	IWDG_Configuration(1000);	//独立看门狗配置	Tout-超时复位时间，单位ms
	
