wegam/STM32F1xWOW/Examples/APP_HC/PC006V21 - 20180102.C
	//4）============================系统嘀嗒时钟配置：做定时程序扫描
	SysTick_Configuration(1000);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
}
/*******************************************************************************
*函数名			:	SensorBoard_Configuration
*功能描述		:	旋转控制传感器板配置
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void SensorBoard_Configuration(void)		//旋转控制传感器板配置
{
	//============================PA6-CCW,PA7-CW配置
	//电机控制板：	PA6-脉冲输出，PA7-方向控制输出
	//传感器板：		PA6，PA7做传感器指示灯（采集信号时闪烁）
	
	//1）============================信号采样闪烁LED配置
	GPIO_Configuration_OPP2	(TXLED_PORT,TXLED_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP2	(RXLED_PORT,RXLED_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	//2）============================传感器接口配置:配置为上拉输入模式(低有效）
	//-----Sensor1-PB4	前传感器
	//-----Sensor2-PB5	后传感器
	//-----Sensor3-PB6	药品传感器
	//-----Sensor4-PB7	备用传感器
	GPIO_Configuration_IPU(Sensor1_Port,	Sensor1_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor2_Port,	Sensor2_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor3_Port,	Sensor3_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
	GPIO_Configuration_IPU(Sensor4_Port,	Sensor4_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
		

	//3）============================CAN配置：500K
	//--------接收电机控制板命令：开启读传感器信号或者关闭
	CAN_Configuration_NR(CAN1_BaudRate);			//CAN1配置---标志位查询方式，不开中断--速率500K
	//4）============================CAN配置滤波器配置
	//-----传感器信号读取滤波器（与旋转电机控制板通讯）：SensorBD_Group，SensorBD_ID
	CAN_FilterInitConfiguration_StdData(SensorBD_Group,SensorBD_ID,(MotorBD_ID^SensorBD_ID)^0XFFFF);			//CAN滤波器配置---标准数据帧模式---BIT7不过滤
	//5）============================系统嘀嗒时钟配置：做定时程序扫描
	SysTick_Configuration(100);			//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server(0.1ms扫描传感器)
}
//==============================================================================




/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Test_modle(void)		//测试模式
{
#ifdef	TestModel
	if(StatusOfWindow	==	0)
	{
		CCWFlag	=	0;	//运行方向标志
		return;
	}
	TestTime++;
	if(TestTime>=1000)
	{
		TestTime	=	0;
	}

	if(RunToWindow!=0)
	{
		return;
	}
	else
	{
		CMDOfWindow	=	(TestTime%MaxWindow)+1;
	}
	
	
	
	
//	if(StatusOfWindow	==	0)
//	{
//		CCWFlag	=	0;	//运行方向标志
//		return;
//	}
//	
//	if(RunToWindow!=0)
//	{
//		TestTime	=	0;
//	}
//	else
//	{
//		TestTime++;
//	}
////	if(RunToWindow!=0)
////	{
////		return;
////	}
//	if(TestTime	>=	500)
//	{
//		TestTime	=	0;
//		if(CCWFlag	==	0)		//正转
//		{
//			CMDOfWindow	=	StatusOfWindow+1;
//			if(CMDOfWindow	>=	MaxWindow)
//			{
//				CCWFlag	=	1;
//			}
//		}
//		else		//反转
//		{
//			CMDOfWindow	=	StatusOfWindow-1;
//			if(CMDOfWindow	<=	1)
//			{
//				CCWFlag	=	0;
//			}
//		}
////		SetToWindows(&CMDOfWindow);		//运行到指定窗口
//	}
#endif
}
//==============================================================================





/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void SWITCHID_Configuration(void)			//拔码开关初始化及读数
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	SWITCHID.NumOfSW	=	6;
	//SW1--PA4
	SWITCHID.SW1_PORT	=	GPIOA;
	SWITCHID.SW1_Pin	=	GPIO_Pin_4;
	//SW2--PA5
	SWITCHID.SW2_PORT	=	GPIOA;
	SWITCHID.SW2_Pin	=	GPIO_Pin_5;
	//SW3--PB12
	SWITCHID.SW3_PORT	=	GPIOB;
	SWITCHID.SW3_Pin	=	GPIO_Pin_12;
	//SW4--PB13
	SWITCHID.SW4_PORT	=	GPIOB;
	SWITCHID.SW4_Pin	=	GPIO_Pin_13;
	//SW5--PB14
	SWITCHID.SW5_PORT	=	GPIOB;
	SWITCHID.SW5_Pin	=	GPIO_Pin_14;
	//SW6--PB15
	SWITCHID.SW6_PORT	=	GPIOB;
	SWITCHID.SW6_Pin	=	GPIO_Pin_15;
	
	SWITCHID_Conf(&SWITCHID);		//
	SWITCHID_Read(&SWITCHID);		//
	
	SwitchData	=	(SWITCHID.nSWITCHID)&0x3F;
	
	if((SWITCHID.nSWITCHID	&	0x20)	==	0x20)
	{
		if((SWITCHID.nSWITCHID	&	0x30)	==	0x30)	//电机控制板
		{
			MotorBD		=	1;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
		}
		else
		{
			SensorBD	=	1;		//传感器板标志，0-非传感器板，1-传感器板		
		}
	}
}


/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Motor_RunSet(int Num)			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
{
	if(Num	==	0)		//强制停止
	{
//		MOTOR_DISABLE;								//停止电机
		PWM_OUT_SetCount(&PWM_Tim,0);		//设置输出个数
	}
	else if(Num>0)
	{
//		Motor_Configuration();			//步进电机驱动配置
		PWM_Tim.PWM_BasicData.PWM_Frequency=MOTOR_PWM_Frequency;						//频率增加--加速
		PWM_OUT_SetFre(&PWM_Tim,10);
		MOTOR_RunRight;													//顺时钟
		PWM_OUT_SetCount(&PWM_Tim,Num);		//设置总输出脉冲个数
	}
	else
	{
//		Motor_Configuration();			//步进电机驱动配置
		PWM_Tim.PWM_BasicData.PWM_Frequency=MOTOR_PWM_Frequency;						//频率增加--加速
		PWM_OUT_SetFre(&PWM_Tim,10);
		Num	=	0	-	Num;
		MOTOR_RunLeft;													//逆时钟
		PWM_OUT_SetCount(&PWM_Tim,Num);		//设置总输出脉冲个数
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	0-无定时器中断，1-有定时器中断
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
u8 Motor_Server(void)				//查询步进电机状态
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	
	//==============电机控制说明
	//运行过程分：启动加速，匀速运行，减速停止
	//窗口位置：
	//电机原点为中间传感器：上电时，先逆时针慢速运转到极限位再回到原点（如果在回极限位过程中找到原点，则停止在原点，初始化完成）
	
	u8 status	=	0;
	
	
