wegam/STM32F1xWOW/Examples/APP_HC/PC006V21 - 20180102.C
	if((MOTOR_TIMx->SR & TIM_IT_Update)==TIM_IT_Update	&&	RunToWindow!=0)			//表示定时中断---运行计数未完
	{
		if(PlusFlg	!=0)			//步进电机脉冲标志，一个上升沿计一个脉冲
		{
			PlusFlg	=	0;				//步进电机脉冲标志，一个上升沿计一个脉冲
			SteepCount	+=	1;							//运行步数计数
			if(RxMessage.StdId==SensorBD_ID&&RxMessage.Data[1]!=0&&RunToWindow==1)
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMx, DISABLE); 	//关闭定时器
			}
			else if(SteepCount>=SteepNeedToRun)	//运行步数到达
			{
				StatusOfWindow	=	RunToWindow;	//新的电机停止窗口位
				RunToWindow			=	0;						//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
				
				MOTOR_PlusLow;		//MOTOR_Plus输出关闭（低电平）
				TIM_Cmd(MOTOR_TIMx, DISABLE); 	//关闭定时器
			}
			else
			{
				if(StatusOfWindow	==	0)
				{
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
				else
				{
					if(SteepCount<PWM_RunUpCount)
					{
						RunFrequency	+=	PWM_UpdataCount;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMx,RunFrequency);		//设定频率
					}
					else if(SteepCount+PWM_RunUpCount>=SteepNeedToRun)
					{
						RunFrequency	-=	PWM_UpdataCount;		//当前运行频率
						TIM_SetFreq(MOTOR_TIMx,RunFrequency);		//设定频率
					}
					MOTOR_PlusLow;		//MOTOR_Plus输出低电平
				}
			}
		}
		else
		{
			PlusFlg	=	1;				//步进电机脉冲标志，一个上升沿计一个脉冲
			MOTOR_PlusHigh;		//MOTOR_Plus输出高电平
		}
		TIM_ClearITPendingBit(MOTOR_TIMx, TIM_IT_Update);			//清除中断标志
	}
	
	
	
	if(StatusOfWindow==0	&&	RunToWindow==0)				//电机上电初始化
	{
		MOTOR_RunLeft;						//逆时针
		PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
		CMDOfWindow				=	1;		//运行到指定窗口命令
		RunToWindow				=	1;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
		
		SteepCount				=	0;		//运行步数计数
		SteepNeedToRun		=	MaxWindow*SteepPerWindow+PWM_RunUpCount;				//需要运行的总步数
		RunFrequency			=	2*MOTOR_PWM_Frequency;
		TIM_SetFreq(MOTOR_TIMx,RunFrequency);		//设定频率MOTOR_PWM_Frequency
		TIM_Cmd(MOTOR_TIMx, ENABLE); 						//开启定时器
	}
	else if(StatusOfWindow!=0	&&	RunToWindow==0	&&	CMDOfWindow!=0)		//电机在待机待机状态下有新的窗口命令
	{
		if(CMDOfWindow	==	StatusOfWindow)
		{			
			RunToWindow				=	0;							//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令
			
			TIM_Cmd(MOTOR_TIMx, DISABLE); 			//关闭定时器
		}
		else if(CMDOfWindow	>	StatusOfWindow)
		{
			MOTOR_RunRight;											//顺时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;		//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			if(RunToWindow	==	1)
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindow+PWM_RunUpCount;				//需要运行的总步数
			}
			else
			{
				SteepNeedToRun		=	(RunToWindow-StatusOfWindow)*SteepPerWindow;				//需要运行的总步数
			}
			
			RunFrequency			=	MOTOR_PWM_Frequency;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMx,RunFrequency);		//设定频率
			
			TIM_Cmd(MOTOR_TIMx, ENABLE); 				//开启定时器
		}
		else if(CMDOfWindow	<	StatusOfWindow)
		{
			MOTOR_RunLeft;											//逆时针
			PlusFlg						=	0;							//步进电机脉冲标志，一个上升沿计一个脉冲				
			RunToWindow				=	CMDOfWindow;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
			CMDOfWindow				=	0;							//运行到指定窗口命令			
			
			SteepCount				=	0;							//运行步数计数
			SteepNeedToRun		=	(StatusOfWindow-RunToWindow)*SteepPerWindow;				//需要运行的总步数	
			
			RunFrequency			=	MOTOR_PWM_Frequency;		//起始频率
			
			TIM_SetFreq(MOTOR_TIMx,RunFrequency);		//设定频率
			
			TIM_Cmd(MOTOR_TIMx, ENABLE); 				//开启定时器			
		}
	}
			
	MotorTime++;
	if(MotorTime>=1000)
	{
		
		MotorTime=0;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
u8 SetToWindows(u8* nWindows)		//运行到指定窗口
{
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 StatusOfWindow	=	0;	//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	//	u8 CMDOfWindow	=	0;		//运行到指定窗口命令
	//	#define	Steeps		4000	//一个窗口用到的驱动脉冲数
	//	#define	MaxWindow	8							//最大窗口数
	
	u8 newWindows	=	*nWindows;
	if(RunToWindow	!=0)				//正在运行
	{
		return 0;
	}
	if(StatusOfWindow	==	0)					//未初始化---需要找原点
	{
		RunToWindow	=	1;											//需要运行到的窗口数
		
		Motor_RunSet(0-(MaxWindow*SteepPerWindow));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
		
		PWM_OUT_SetFre(&PWM_Tim,MOTOR_PWM_Frequency);
		MOTOR_RunRight;													//顺时钟
		PWM_OUT_SetCount(&PWM_Tim,MaxWindow*SteepPerWindow);		//设置总输出脉冲个数

		return 0;
	}
	if(newWindows	==0	&&	StatusOfWindow!=0)									//无效指令
	{
		Motor_RunSet(0);								//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
		return 0;
	}	
	if(newWindows	>	MaxWindow)					//超出最大窗口数里
	{
		*nWindows	=	0;			//将指令清除
		return 0;	
	}
	if(newWindows	==	StatusOfWindow)		//当前窗口---不需要旋转
	{
		*nWindows	=	0;			//将指令清除
		return 0;
	}
	
	if(newWindows	>	StatusOfWindow)	//顺时针转动
	{
		RunToWindow	=	newWindows;		//需要运行到的窗口数
//		newWindows	=	newWindows-StatusOfWindow;
		Motor_RunSet(((newWindows-StatusOfWindow)*SteepPerWindow));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//		Motor_RunSet(0-((StatusOfWindow-newWindows)*Steeps));				//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
	}
	else		//逆转
	{
		RunToWindow	=	newWindows;
		Motor_RunSet(0-((StatusOfWindow-newWindows)*SteepPerWindow));				//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
//		Motor_RunSet(((newWindows-StatusOfWindow)*Steeps));			//使药架旋转---Num为正值时表时顺时针转(从上往下视角)Num个格数，负值时为逆时针转Num个格数，0为停止
	}
	*nWindows	=	0;			//将指令清除
	return 1;
}



/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void CAN_Server(void)			//CAN收发数据管理
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	u8 status	=	0;		//CAN读取返回0表示无效
	
